#+TITLE: Clase 08 - Memoria Virtual
#+STARTUP: inlineimages

#+BEGIN_COMMENT
Te quedaste en clase 9 - algoritmos y casos especiales - 35:42
con el *clock modificado*
#+END_COMMENT

*** Ejemplo
    *Observaciones:*
    - Siempre que cargamos una nueva página, va a tener el bit de uso activado osea ~u=1~
    - Si el cursor apunta a una página N^⁰ con ~u=0~ y en la secuencia se va a cargar esa página N,
      entonces se habilita el *bit de uso* pasando a ~u=1~ y avanzando el cursor y analizar el resto
    
    |---------------------------+-------+-------+-------+-------+--------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Secuencia de Páginas      |     2 | 3'    |     2 | 1     | 5'     | 2     | 4'    | 5     | 3     | 2'    | 5     | 2     | TOTAL |
    |---------------------------+-------+-------+-------+-------+--------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Bits                      |   P U | P U   |   P U | P U   | P U    | P U   | P U   | P U   | P U   | P U   | P U   | P U   |       |
    |---------------------------+-------+-------+-------+-------+--------+-------+-------+-------+-------+-------+-------+-------+-------|
    | 1º Frame (marco en MP)    | ->2^¹ | ->2^¹ | ->2^¹ | ->2^¹ | ~5^¹~  | 5^¹   | ->5^¹ | ->5^¹ | ~3^¹~ | 3^¹   | ->3^¹ | ->3^¹ |       |
    | 2º Frame (marco en MP)    |       | 3'^¹  |  3'^¹ | 3'^¹  | ->3'^⁰ | ~2^¹~ | 2^¹   | 2^¹   | ->2^⁰ | ->2^¹ | 2^⁰   | 2^¹   |       |
    | 3º Frame (marco en MP)    |       |       |       | 1^¹   | 1^⁰    | ->1^⁰ | ~4^¹~ | 4^¹   | 4^⁰   | 4^⁰   | ~5^¹~ | 5^¹   |       |
    |---------------------------+-------+-------+-------+-------+--------+-------+-------+-------+-------+-------+-------+-------+-------|
    | PFs                       |     1 | 1     |     0 | 1     | 1      | 1     | 1     | 0     | 1     | 0     | 1     | 0     |     8 |
    |---------------------------+-------+-------+-------+-------+--------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Acceso a SWAP (disco)     |     1 | 1     |     0 | 1     | 1      | 2     | 1     | 0     | 2     | 0     | 2     | 0     |    11 |
    |---------------------------+-------+-------+-------+-------+--------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Operación de Lectura en   |   p=2 | p=3   |       | p=1   | p=5    | p=2   | p=4   |       | p=3   |       | p=5   |       |       |
    |---------------------------+-------+-------+-------+-------+--------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Operación de Escritura en |       |       |       |       |        | p=3   |       |       | p=5   |       | p=4   |       |       |
    |---------------------------+-------+-------+-------+-------+--------+-------+-------+-------+-------+-------+-------+-------+-------|
    #+TBLFM: @6$14=vsum($2..$-1)::@7$14=vsum($2..$-1)

    *Referencias:*
    - En la 2da fila Bits
      1. P: página
      2. U: BIT de Uso
    - Las páginas que estén marcadas así ~numero~ indica como va avanzar el *puntero* entre los *frames*
    - Las potencias en ^¹ se refieren a bit_de_uso=1 (habilitado)
    - Las potencias en ^⁰ se refieren a bit_de_uso=0 (deshabilitado)
      
    #+BEGIN_QUOTE
    Un ejemplo de que ocurrió entre la posicion=4 y posicion=5 de la secuencia de páginas
    
    En la posicion=5 de la secuencia de páginas, inicia el algoritmo de sustitución
    1. Observamos que el puntero en estaba apuntando a la página=2 en el frame=1 en la posicion anterior (->2^¹)
    2. En el frame 1, modifica el BIT de uso de la página 2 a ~u=0~, y avanza el cursor al siguiente frame (->3'^¹)
    3. En el frame 2, modifica el BIT de uso de la página 3 a ~u=0~  y avanza el cursor al siguiente frame (->1^¹)
    4. En el frame 3, modifica el BIT de uso de la página 1 a ~u=0~ y avanza el cursor al siguiente frame
       pero.. como no hay más frames y se comporta como una *cola circular* coloca el cursor al *frame 1*
       
    En los pasos (1) (2) (3) (4) el algoritmo avanzó en cada frame, y actualizó el bit de uso en cada página, quedando así
    | 1º FRAME | ->2^⁰ |
    | 2º FRAME | 3^⁰   |
    | 3º FRAME | 1^⁰   |
    
    5. El algoritmo elige la página 2 es la víctima, porque el puntero volvió a la página 2, y su bit de uso es ~u=0~
    6. El algoritmo sustituye la *página 2* por la *página 5* y avanza el cursor al siguiente frame quedando
    |          | 5'    |
    |----------+-------|
    | 1º FRAME | 5^¹   |
    | 2º FRAME | ->3^⁰ |
    | 3º FRAME | 1^⁰   |

    El bit de uso de la página 3 y página 1 quedó en ~u=0~ porque el algoritmo recorrió cada frame avanzando el puntero,
    cuando el bit de uso era 1.
    Bit de uso es 1? Ok lo cambio a 0 y avanzo el cursor a la página del siguiente frame,
    Bit de uso es 1? Ok lo cambio a 0 y avanzo el cursor a la página del siguiente frame,
    y asi.. pudiendo volver hasta el principio si todas las paginas tenian el bit de uso en 1
    #+END_QUOTE

    #+BEGIN_QUOTE
    En la posicion=9 de la secuencia de páginas, ocurre lo mismo que en la posicion=5..

    1. Analizamos la posición anterior, el puntero apunta a la *página 5* y éste tiene bit de uso ~u=1~
       entonces lo modifica a ~u=0~, avanza el puntero a la página del siguiente frame (frame=2)
    2. El puntero apunta a la página 2, tiene bit de uso ~u=1~ lo modifica a ~u=0~ y avanza el puntero al sig. frame
    3. Se repite lo mismo, el puntero apunta a la página 3, tiene bit de uso ~u=1~ lo modifica a ~u=0~ y avanza el puntero al sig. frame
       como es una cola circular, vuelve primer frame
    4. En este momento todas las páginas quedaron con el bit de uso ~u=0~,
       como el puntero apunta a la *página 5* y su bit de uso es ~u=0~ entonces es víctima,
       entonces se sustituye la *pagina 5* por la *página 3*

    En resumen, todas las páginas se les modificó el bit de uso a ~u=0~ porque el puntero fue avanzando frame por frame
    y las páginas tenian el bit de uso en 1, cuando el puntero volvió al primer frame que tenia la *página 5* (la victima)
    la sustituyó por la *pagina 3*
    
    Nota 1: Como se carga la página 3, ésta va a tener el bit de uso en ~u=1~
    Nota 2: Como la página 5 estaba modificada xq tenía el apóstrofe de que estaba en *modo de escritura*,
    se debe hacer un acceso a disco para guardar los cambios (operación de escritura)
    #+END_QUOTE

    #+BEGIN_QUOTE
    En la posicion=9,10,11 la *página 2* cambió el bit de uso de ~u=0~ a ~u=1~ y luego a ~u=0~
    
    en la posicion=10
    1. se accedía la página ~2'~ que ya estaba en memoria (en la posicion anterior)
       pero tenía el *bit de uso* desactivado osea ~u=0~ entonces sólo se volvió a activar
       cambiandolo a ~u=0~ quedando (->2^¹)

    
    en la posicion=11
    1. se accedía a la *pagina 5* como el puntero apuntaba a la *página 2* (->2^¹)
       y tenía el *bit de uso* en ~u=1~ se lo cambio a ~u=0~ para darle otra oportunidad,
    2. avanzó el cursor al siguiente frame que tenía la *pagina 4* (->4^⁰)
       pero como tenía el *bit de uso* en ~u=0~ era víctima, y sustituyó la *pagina 4* por la *pagina 5*
    #+END_QUOTE
    
    #+BEGIN_COMMENT
    *Caso (A): Cuando el puntero avanza, cuando se cambia el BIT de Uso y cuando se ejecuta el algoritmo*
    En la posición=4 de la secuencia observamos la página ~1~ 
    1. Al ingresar el número de página en el 3º Frame, ya puede iniciar el algoritmo
    2. El puntero estaba en el 1º frame que contiene al ~2~ y este tiene ~BIT_uso=1~, 
       entonces lo modifica a cero ~bit_uso=0~ y avanza el puntero al 2º frame
    3. El puntero está en el 2º frame que contiene a ~3'~ este tiene ~bit_uso=1~
       lo cambia a cero y avanza el puntero al 3º frame
    4. El puntero está en el 3º frame que contiene a ~1~ este también tiene ~bit_uso=1~
       lo modifica a cero y vuelve a apuntar al 1º frame que contiene al ~2~
    5. El puntero está en el 1º frame que contiene a la pag. ~2~
       pero.. como su ~bit_uso=0~ aplicará la sustitución de página por ~5~
       y cambia el ~bit_uso=1~ y avanza el puntero al 2º frame
    #+END_COMMENT

    #+BEGIN_COMMENT
    validar
    
    *Caso (B): Dos accesos a SWAP (disco)*
    En la posicion=6 de la secuencia notamos que en la página ~2~ que está seguido del ~5~
    hay dos accesos a disco (swap) porque
    1. El frame que se sustituye es el 2º y tiene a la página ~3~ que estaba modificada
       osea tenia bit_modificado=1, por tanto se debe guardar el valor de esa página ~3~
       en SWAP para no perder los datos(primer acceso a disco). Y luego escribir en SWAP
       por el propio PF (xq no estaba en el espacio de direcciones del proceso) la página ~2~ 
       en el mismo 2º frame (2do acceso a disco)
    #+END_COMMENT
*** Ejemplo

    | Secuencia de páginas      |         2 | 3'        |         2 | 1         | 5'        | 2         | 4'        | 5         | 3         | 2'         | 5         | 2         | TOTAL |
    |---------------------------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+------------+-----------+-----------+-------|
    | BITS                      |     P U M | P U M     |     P U M | P U M     | P U M     | P U M     | P U M     | P U M     | P U M     | P U M      | P U M     | P U M     |       |
    |---------------------------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+------------+-----------+-----------+-------|
    | FRAME 1                   | ->2^(1,0) | ->2^(1,0) | ->2^(1,0) | ->2^(1,0) | ~5^(1,1)~ | ->5^(1,1) | 5^(0,1)   | ~5^(1,1)~ | ->5^(0,1) | ~2'^(1,1)~ | 2'^(1,1)  | 2'^(1,1)  |       |
    | FRAME 2                   |           | 3^(1,1)   |   3^(1,1) | 3^(1,1)   | ->3^(0,1) | 3^(0,1)   | ~4^(1,1)~ | 4^(1,1)   | 4^(0,1)   | ->4^(0,1)  | ~5^(1,0)~ | 5^(1,0)   |       |
    | FRAME 3                   |           |           |           | 1^(1,0)   | 1^(0,0)   | ~2^(1,0)~ | ->2^(1,0) | ->2^(1,0) | ~3^(1,0)~ | 3^(1,0)    | ->3^(1,0) | ->3^(1,0) |       |
    |---------------------------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+------------+-----------+-----------+-------|
    | Page Faults               |         1 | 1         |         0 | 1         | 1         | 1         | 1         | 0         | 1         | 1          | 1         | 0         |     9 |
    |---------------------------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+------------+-----------+-----------+-------|
    | Acceso a SWAP (disco)     |         1 | 1         |         0 | 1         | 1         | 1         | 2         | 0         | 1         | 2          | 2         | 0         |    12 |
    |---------------------------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+------------+-----------+-----------+-------|
    | Operación de Lectura en   |       p=2 | p=3       |           | p=1       | p=5       | p=2       | p=4       |           | p=3       | p=2        | p=5       |           |       |
    |---------------------------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+------------+-----------+-----------+-------|
    | Operación de Escritura en |           |           |           |           |           |           | p=3       |           |           | p=5        | p=4       |           |       |
    |---------------------------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+------------+-----------+-----------+-------|
    #+TBLFM: @6$14=vsum($2..$-1)::@7$14=vsum($2..$-1)

    #+BEGIN_QUOTE
    Entre la posicion=4,5 el cursor pasa por cada frame, modificando el *bit de uso* ~u~
    de las *paginas 2,3,1* a ~u=0~, quedando el cursor de nuevo en el primer frame
    y siendo ahí donde sustituye la página por la *pagina 5*
    
    y avanzando el cursor al siguiente frame (2) que tiene la *pagina 3*
    #+END_QUOTE

    #+BEGIN_COMMENT
    <<DUDA>>
    Entre la posicion=8,9 de la secuencia, el cursor se queda en el *frame 1* porque da vuelta dos veces (?)
    por eso no queda en el *frame 2* ?
    #+END_COMMENT

    #+BEGIN_QUOTE
    Entre las ultimas dos posiciones de la secuencia,
    se quiere acceder a la *pagina 2* que ya está cargada en memoria,
    y además el *bit de uso* ya está en ~u=1~ por tanto queda igual a la posicion anterior a la última

    si.. el *bit de uso* hubiese estado en ~u=0~ entonces sólo se habilitaba cambiando a 1
    #+END_QUOTE
